app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC
---
  def index
    @posts = Post.all.order(id: "DESC")

INSERT INTO `posts` (`content`, `checked`, `created_at`, `updated_at`) VALUES ('test', FALSE, '2020-08-01 03:04:31.482610', '2020-08-01 03:04:31.482610')
---
  def create
    Post.create(content: params[:content])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-08-01 00:47:28.744311' WHERE `posts`.`id` = 4
---
  def checked
    post = Post.find(params[:id])
    if post.checked then
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])